Repository: jmenashe/diff-ext
Catalog: trunk/gdiff-ext/po/*.po
Languages: ru

source: Compare later
ru: Сравнить позже

source: Select file for comparison
ru: Запомнить файл для последующего сравнения

source: Compare to '%s'
ru: Сравнить с '%s'

source: Compare '%s' and '%s'
ru: Сравнить '%s' и '%s'

source: Compare
ru: Сравнить

source: Compare selected files
ru: Сравнить выбранные файлы

source: 3-way compare to '%s'
ru: 3-х стороннее сравнение с '%s'

source: 3-way compare '%s', '%s' and '%s'
ru: 3-х стороннее сравнение '%s', '%s' и '%s'

source: 3-way compare
ru: 3-х стороннее сравнение

source: 3-way compare selected files
ru: 3-х стороннее сравнение выбранных файлов

source: Diff-ext Setup
ru: Установки Diff-ext

source: Compare command:
ru: Команда сравнения

source: Select file comparison tool
ru: Выбирете команду сравнения

source: 3-way compare command:
ru: Команда 3-х стороннего сравнения

source: Select 3-way comparison tool
ru: Выбирете команду 3-х стороннего сравнения

source: _3-way compare
ru: 3-х стороннее сравнение

source: Enable/disable 3-way compare
ru: Включить/выключить 3-х стороннее сравнение

source: diff-ext setup
ru: Установки Diff-ext тест

source: (c) 2007 Sergey Zorin
ru: (c) 2007 Сергей Зорин. Все права защищены.

source: Copyright (c) 2007, Sergey Zorin All rights reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: 1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. 2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
ru: Copyright (c) 2007 Сергей Зорин Все права защищены. Распространение и использование исходных и 'скомпилированных' форм с модификацией или без оной, разрешены при соблюдении следующих соглашений: 1. Распространяемые копии исходного кода должны сохранять вышеупомянутые объявления copyright, этот список положений и сохранять следующий отказ от прав. 2. Распространяемые копии скомпилированных форм должны повторять вышеупомянутые объявления copyright, этот список положений и следующий отказ в документации и/или других материалах, поставляемых с дистрибьюцией. ЭТОТ ПРОГРАМНЫЙ ПРОДУКТ ПОСТАВЛЯЕТСЯ ВЛАДЕЛЬЦЕМ АВТОРСКИХ ПРАВ И ЖЕРТВОВАТЕЛЯМИ "КАК ЕСТЬ" И ЛЮБЫЕ ЯВНЫЕ ИЛИ НЕЯВНЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ НЕЯВНЫМИ ГАРАНТИЯМИ, КОММЕРЧЕСКОЙ ЦЕННОСТИ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ ОТРИЦАЮТСЯ. НИ В КОЕМ СЛУЧАЕ ВЛАДЕЛЕЦ АВТОРСКИХ ПРАВ И ЖЕРТВОВАТЕЛИ НЕ ДОЛЖНЫ БЫТЬ ОТВЕТСТВЕННЫМИ ЗА ЛЮБОЙ ПРЯМОЙ, КОСВЕННЫЙ, СЛУЧАЙНЫЙ, СПЕЦИАЛЬНЫЙ, ОБРАЗЦОВЫЙ ИЛИ ПОСЛЕДУЮЩИЙ УЩЕРБЫ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ПОСТАВКОЙ ТОВАРОВ ЗАМЕНЫ ИЛИ УСЛУГ; ПОТЕРЮ ДАННЫХ ИЛИ ИХ НЕПРАВИЛЬНУЮ ПЕРЕДАЧУ ИЛИ ПОТЕРИ; ПРИОСТАНОВЛЕНИЕ БИЗНЕСА), И ТЕМ НЕ МЕНЕЕ ВЫЗВАННЫЕ И В ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, НЕЗАВИСИМО ОТ КОНТРАКТНОЙ, СТРОГОЙ ОТВЕТСТВЕННОСТИ, ИЛИ ПРАВОНАРУШЕНИИ (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНЫМ СПОСОБОМ), ВОЗНИКШЕМ ЛЮБЫМ ПУТЕМ ПРИ ИСПОЛЬЗОВАНИИ ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ БЫ БЫЛО СООБЩЕНО О ВОЗМОЖНОСТИ ТАКОГО УЩЕРБА.

source: Couldn't find pixmap file: %s
ru: Не могу найти файл картинки: %s
